EDT/MPCurier/src/Catalogs/РегиональныеТерминалы/РегиональныеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегиональныеТерминалы</name>
  <attributes>
    <name>НачальнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксАдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаСтаршегоЛогиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиЧековРМЭкипажа</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/MPCurier/src/CommonModules/ГеопозиционированиеСервер/Module.bsl
#Область ПрограммныйИнтерфейс
// Получить имя провайдера.
// 
// Возвращаемое значение:
//  Структура - Получить имя провайдера:
// * Выбор - ПеречислениеСсылка.ИспользуемыйПровайдерГеопозиционирования - 
// * Имя - Строка - 
Функция ПолучитьИмяПровайдера() Экспорт
	
	Выбор = Константы.ВыборПровайдераГеопозиционирования.Получить();

	
	Структура = Новый Структура();
	Структура.Вставить("Выбор", Выбор);
	Структура.Вставить("Имя", Константы.ИмяПровайдераГеопозиционирования.Получить());
    Возврат Структура;
    
КонецФункции

// Получить текущий регион.
// 
// Параметры:
//  ДанныеМестоположения - ДанныеМестоположения - Данные местоположения
// 
// Возвращаемое значение:
//  Неопределено - Получить текущий регион
Функция ПолучитьТекущийРегион(ДанныеМестоположения) Экспорт
	Если ДанныеМестоположения = Неопределено Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РегиональныеТерминалы.Ссылка КАК Регион
	            |ИЗ
	            |	Справочник.РегиональныеТерминалы КАК РегиональныеТерминалы
	            |ГДЕ
	            |	&Широта >= РегиональныеТерминалы.НачальнаяШиротаЗоны
	            |			И &Широта < РегиональныеТерминалы.КонечнаяШиротаЗоны
	            |	И &Долгота >= РегиональныеТерминалы.НачальнаяДолготаЗоны
	            |			И &Долгота < РегиональныеТерминалы.КонечнаяДолготаЗоны";
	Зап.УстановитьПараметр("Широта", ДанныеМестоположения.Широта);
	Зап.УстановитьПараметр("Долгота", ДанныеМестоположения.Долгота);
	
	Рез = Зап.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб = Рез.Выбрать();
		Если Выб.Следующий() Тогда
			Возврат Выб.Регион;
		КонецеСли;
	КонецеСли;
КонецФункции	


// Возможно и необходимо выбрать регион работы МП.
// 
// Возвращаемое значение:
//  Булево - Возможно и необходимо выбрать регион работы МП
Функция ВозможноИНеобходимоВыбратьРегионРаботыМП() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегиональныеТерминалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РегиональныеТерминалы КАК РегиональныеТерминалы";
	СправочникРегионовНеПустой = Не Зап.Выполнить().Пустой(); 
	
	Если СправочникРегионовНеПустой И Не ЗначениеЗаполнено(Константы.РегионМП.Получить()) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;			
	КонецеСли;
КонецФункции	

// Установить текущий регион.
// 
// Параметры:
//  Регион - СправочникСсылка.РегиональныеТерминалы - Регион
Процедура УстановитьТекущийРегион(Регион) Экспорт
	Константы.РегионМП.Установить(Регион);
	ПараметрыСеанса.РегионМП = Регион;
КонецПроцедуры	

// Установить данные провайдера геопозиционирования в константах.
// 
// Параметры:
//  ИмяПровайдера - Строка - Имя провайдера
//  ВыборПровайдераГеопозиционирования - Строка - Выбор провайдера геопозиционирования
Процедура УстановитьДанныеПровайдераГеопозиционированияВКонстантах(ИмяПровайдера = "", ВыборПровайдераГеопозиционирования = "") Экспорт
	Если ЗначениеЗаполнено(ИмяПровайдера) Тогда
		Константы.ИмяПровайдераГеопозиционирования.Установить(ИмяПровайдера);	
	КонецеСли;
		
	Если ЗначениеЗаполнено(ВыборПровайдераГеопозиционирования) Тогда
		Константы.ВыборПровайдераГеопозиционирования.Установить(ВыборПровайдераГеопозиционирования);	
	КонецеСли;		
КонецПроцедуры	
#КонецОбласти
